# Pandas Guide


### Table of Contents 
1. Understanding the Pandas
    - Data Viewing 
    - Understanding the components of the DF 
        - Series
        - Index 
2. Importing/Converting Data into Pandas
    - Importing Data 
        - Excel 
        - Stata File
        - SAS File
        - JSON File
        - Online File
    - Converting Data from already existing data structure 
        - List
        - Dictionary 
        - NP Array 
3. Data Manipulation 
    - Creating Variables
    - Managing Variables
    - Managing Missing Values
    - Check duplicates
    - Converting data formats
    - Cleaning Dates
    - String Commands
    - Renaming Variables (Mass renaming)
    - Reshaping Data
    - Merging/Appending Data
4. Regression Analysis 
    - Statsmodels
5. Outputs from Pandas 
    - Tabouts 
    - Export Summary Stats
    - Tables from Regressions 
    - Graphs and So On
    
Resources: 
1. https://plot.ly/python/
2. https://nbviewer.jupyter.org/github/QuantEcon/QuantEcon.notebooks/blob/master/pandas_and_matplotlib.ipynb
3. https://cheatsheets.quantecon.org/stats-cheatsheet.html
4. https://nbviewer.jupyter.org/github/QuantEcon/QuantEcon.notebooks/blob/master/sci_python_quickstart.ipynb
5. https://cheatsheets.quantecon.org/
6. https://seaborn.pydata.org/ 
7. https://data36.com/pandas-tutorial-1-basics-reading-data-files-dataframes-data-selection/ 
8. https://www.analyticsvidhya.com/blog/2016/01/12-pandas-techniques-python-data-manipulation/
9. https://paulovasconcellos.com.br/28-useful-pandas-functions-you-might-not-know-de42c59db085
10. https://realpython.com/python-pandas-tricks/
11. https://dataconomy.com/2015/03/14-best-python-pandas-features/

In [132]:
import os
import numpy as np
import pandas as pd
path_link = "D:/Users/asimon/Desktop/Python User Guide"
os.chdir(path_link)
df = pd.read_excel('Minimum Wage Data.xlsx')

## 1. Understanding Pandas

### Why Python for data analaysis?

Python is a open-source general purpose programming language with bulit-in functions, clean and readable syntax, and an active community developing products to improve Python's abilities. Python's simple and easy to understand syntax makes the learning curve much less steep compared to most other statistical software packages and programming langauges. Python has made great strides in its data analysis capabilities in the past decade with new machine learning packages like SciKit-learn, data visualizations tools like Seaborn and Plotly, and text analysis packages like NTLK or Gensim. Python's multiple IDE options, like Spyder, PyCharm, or Juypter Notebook, also give users flexibility in how they share their work with others.

### Pandas: How to begin data analysis in Python.

While the built-in functions suffice for general programming, data analysis requires additional functions and objects. Pandas is a popular data analysis package that is simple to use the moment you start Python. 

The reason Pandas is  popular for data science and analysis is that it introduces three useful objects that mirror similar data structures from other statistical packages and don't add complexity to the simple Pythonic syntax. These objects are:

    1. The DataFrame
    2. The Series
    3. The Index


The rest of this chapter goes as follows: The first section of this guide will cover the objects and how they function. The second section of this guide will show how one can import and convert data into the DataFrame object. The third section will cover the steps needed to understand and maniuplate your data before analysis. The fourth section covers regression analysis and intrepreting the results. And the final section covers outputting results either in the form of data visualization or summary statistic. 

This guide is not meant to be comprehensive, the most comprehensive documentation for Pandas is found (here)[https://pandas.pydata.org/pandas-docs/stable/pandas.pdf]. Documentation for any program is long and don't, often times, reflet the best practices a programming community has estbalished. The purpose of this document is inform a potential user of the functionality of Pandas and a general overview of how to accomplish basic data analysis tools.

### DataFrame

The DataFrame is the main contribution of Pandas. The DataFrame is a 2-dimensional labeled structure with columns and rows. The columns and the rows represent one dimension each. The DataFrame is anaglous to the R and Stata DataFrame and the Excel spreadsheet. Or put in more technical terms, the DataFrame is a tabular datastructure. The code below defines a DataFrame and then prints it out to view:

In [133]:
d = pd.DataFrame({'one': [1., 2., 3., 4.],
     'two': [4., 3., 2., 1.]})
print(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

"d" is the name of our DataFrame and it has two columns, one and two, and four rows, 0-3. (Python is 0 indexed, meaning it counts from 0...1...2...and so on.)

Each datapoint can be referenced through its Index (which corresponds to its row, the far most left value) and the column signifies what the value means. We can call a single Pandas column with this command:

In [134]:
print(d['one'])

0    1.0
1    2.0
2    3.0
3    4.0
Name: one, dtype: float64

The values on the left represent the Index we saw earlier. Notice: A Python's column's type is itself a Pandas object, the Series. More on this obect below.

### Series
A Series ia one-dimensional indexed array that can contain any Python data type. To create a Series you use the function:

In [135]:
series_ex = pd.Series([1,2,3,4])

 A Series in Pandas is similar visually to a list, but there are key distinctions in how they opearte. As mentioned, Pandas is used for data analysis, so a Series has data analysis type functions, while a list would require either a for loop or list comprehension.

In [136]:
print("This is a Series")
print(series_ex)
series_ex = series_ex*2
print("\n")
print("This is a Series multipled by two")
print(series_ex)

This is a Series
0    1
1    2
2    3
3    4
dtype: int64


This is a Series multipled by two
0    2
1    4
2    6
3    8
dtype: int64

In [137]:
list = [1,2,3,4]
print("This is a List")
print(list)
print("\n")
list = list*2
print("This is a List multipled by two")
print(list)

This is a List
[1, 2, 3, 4]


This is a List multipled by two
[1, 2, 3, 4, 1, 2, 3, 4]

### Index

Both the Series and the DataFrame have an index that signifies order and allows for referncing specific points. The Index itself is an object - though by itself if holds little purpose.

In [138]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

### Importing Pandas
Pandas is not native to Python, so it has to be installed. Foruntately most downloads will contain Pandas, but you will still have to load the package in. This code will accomplish that:

In [139]:
import pandas

However Pandas is used for often, so most refer to it as "pd" when calling it. So, typically Pandas is imported as follows:

In [140]:
import pandas as pd

It's also useful to import a few other packages, mostly numpy and stats

In [141]:
import numpy as np
import statsmodels.api as sm

## 2. Importing Data

Python has the funcitonality to read multiple data types, such as excel, csv, dta, json, sql and more. The syntax follows a similar structure: pd.read_*(). 

Examples follow:

### Importing data

In [142]:
# Importing data from Stata 
pd.read_stata('State_ETO_short.dta')

  state_abbv   ETO   ETW  ETOW    ET_cat ET_Work_cat ET_ET_Work_cat
0         VA   2.0  62.5  64.5    0 - 5%       30% <          30% <
1         TN   5.5  20.8  26.3   5 - 10%    10 - 30%       20 - 30%
2         VT  19.9   0.7  20.6  15 - 20%      0 - 5%       20 - 30%
3         ID   6.0  11.4  17.4   5 - 10%    10 - 30%       10 - 20%
4         OH   1.9  15.0  16.9    0 - 5%    10 - 30%       10 - 20%

This is how we read in a DataFrame, but we still need to store and name it. This can be accomplished in one-line:

In [143]:
df = pd.read_stata('.\State_ETO_short.dta')

Now, when we call "df", we'll get the DataFrame that corresponds to "pd.read_stata('.\State_ETO.dta')"

In [144]:
df

  state_abbv   ETO   ETW  ETOW    ET_cat ET_Work_cat ET_ET_Work_cat
0         VA   2.0  62.5  64.5    0 - 5%       30% <          30% <
1         TN   5.5  20.8  26.3   5 - 10%    10 - 30%       20 - 30%
2         VT  19.9   0.7  20.6  15 - 20%      0 - 5%       20 - 30%
3         ID   6.0  11.4  17.4   5 - 10%    10 - 30%       10 - 20%
4         OH   1.9  15.0  16.9    0 - 5%    10 - 30%       10 - 20%

In [145]:
# Importinf data from excel into pandas
df = pd.read_excel('Minimum Wage Data_Short.xlsx')

In [146]:
df

,Year,State,Table_Data,High.Value,Low.Value,CPI.Average,High 2018,Low.2018
0,1968,Alabama,NaN,0.00000,0.00000,34.783333,0.00,0.00
1,1968,Alaska,2.1,2.10000,2.10000,34.783333,15.12,15.12
2,1968,Arizona,18.72 - 26.40/wk(b),0.66000,0.46800,34.783333,4.75,3.37
3,1968,Arkansas,1.25/day(b),0.15625,0.15625,34.783333,1.12,1.12
4,1968,California,1.65(b),1.65000,1.65000,34.783333,11.88,11.88
5,1968,Colorado,1.00 - 1.25(b),1.25000,1.00000,34.783333,9.00,7.20

### Exporting Data

The syntax to export data follows a similar pattern and can be seen here:

In [147]:
df.to_csv('Minimum Wage Data.csv')

### Converting Data

Often times, data already in a Python dataformat will need to be convereted to a Pandas object. The steps to convert an object follow:

In [148]:
# List
my_list = [1,2,3,4,5,6,7,8,9]
columns = ['a', 'b', 'c']


pd.DataFrame(np.array(my_list).reshape(3,3), columns = columns)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

An import thing to note: pd.DataFrame has a multitude of options. The most import of which is what follows right after the first parathentical which is the data that is to be transformed. Here are transform the list [1,2,3,4,5,6,7,7,8,9] into an np.array with the shape of: 

    [[1,2,3],
    [4,5,6], 
    [7.8.9]]
    
Then we transform the data to a pandas dataframe which gives us: 

    0	1	2	3
    1	4	5	6
    2	7	8	9
    
    
Finally, we add a list of columns name with the option columns = columns to get the final dataframe.


        a	b	c
    0	1	2	3
    1	4	5	6
    2	7	8	9

In [149]:
# Dictionary
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

## 3. Data Manipulation

The first step to data analysis is often understanding and viewing the data.

### Understanding our data
#### Viewing our data

Simply typing either "print(df)" prints the DataFrame. But as we move into a big data enviroment, we will need a way to print subsets of our data. 


Pandas DataFrame has useful methods for this: including .head() and .tail()

In [150]:
print(df.head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018
0       0.00      0.00
1      15.12     15.12
2       4.75      3.37
3       1.12      1.12
4      11.88     11.88

.head() automatically prints out the first 5 observations. We can specify how many observations we want within the parathetnicals.

In [151]:
print(df.head(2))

   Year    State Table_Data  High.Value  Low.Value  CPI.Average  High 2018  \
0  1968  Alabama        NaN         0.0        0.0    34.783333       0.00
1  1968   Alaska        2.1         2.1        2.1    34.783333      15.12

   Low.2018
0      0.00
1     15.12

A similar method called .tail() exists, with the same specification abilities.

In [152]:
df.tail(2)

,Year,State,Table_Data,High.Value,Low.Value,CPI.Average,High 2018,Low.2018
4,1968,California,1.65(b),1.65,1.65,34.783333,11.88,11.88
5,1968,Colorado,1.00 - 1.25(b),1.25,1.00,34.783333,9.00,7.20

It's also good to get general information on the dataframe from .info() and to understand the datatypes of each of the columns. 

.info() gives a variety of useful information and .dtypes prints out the data types for each column.

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
Year           6 non-null int64
State          6 non-null object
Table_Data     5 non-null object
High.Value     6 non-null float64
Low.Value      6 non-null float64
CPI.Average    6 non-null float64
High 2018      6 non-null float64
Low.2018       6 non-null float64
dtypes: float64(5), int64(1), object(2)
memory usage: 464.0+ bytes

In [154]:
df.dtypes

Year             int64
State           object
Table_Data      object
High.Value     float64
Low.Value      float64
CPI.Average    float64
High 2018      float64
Low.2018       float64
dtype: object

We can also use .describe() to get a good understanding of basic summary statistics about our data.

In [155]:
df.describe()

         Year  High.Value  Low.Value  CPI.Average  High 2018   Low.2018
count     6.0    6.000000   6.000000     6.000000   6.000000   6.000000
mean   1968.0    0.969375   0.895708    34.783333   6.978333   6.448333
std       0.0    0.838676   0.844059     0.000000   6.039584   6.078060
min    1968.0    0.000000   0.000000    34.783333   0.000000   0.000000
25%    1968.0    0.282188   0.234187    34.783333   2.027500   1.682500
50%    1968.0    0.955000   0.734000    34.783333   6.875000   5.285000
75%    1968.0    1.550000   1.487500    34.783333  11.160000  10.710000
max    1968.0    2.100000   2.100000    34.783333  15.120000  15.120000

We can also do our traditional slicing, to view pieces of our dataframe

In [156]:
df[1:4]

,Year,State,Table_Data,High.Value,Low.Value,CPI.Average,High 2018,Low.2018
1,1968,Alaska,2.1,2.10000,2.10000,34.783333,15.12,15.12
2,1968,Arizona,18.72 - 26.40/wk(b),0.66000,0.46800,34.783333,4.75,3.37
3,1968,Arkansas,1.25/day(b),0.15625,0.15625,34.783333,1.12,1.12

You can also do all of these methods on a single series

In [157]:
df['Year'].head()

0    1968
1    1968
2    1968
3    1968
4    1968
Name: Year, dtype: int64

Or, you can do multiple at one time

In [158]:
(df[['State', 'Table_Data']].head())

        State           Table_Data
0     Alabama                  NaN
1      Alaska                  2.1
2     Arizona  18.72 - 26.40/wk(b)
3    Arkansas          1.25/day(b)
4  California              1.65(b)

### Subsetting data

Subsetting the data is useful when the data are large or when only a specificed subset is needed for analysis. Loading in a larger dataset for example:

In [159]:
df = pd.read_excel("Minimum Wage Data.xlsx")

Viewing the size and columns of the data:

In [160]:
print(len(df))
print(df.columns)

2750
Index(['Year', 'State', 'Table_Data', 'High.Value', 'Low.Value', 'CPI.Average',
       'High 2018', 'Low.2018'],
      dtype='object')

We have 8 variables: Year, State, Table_Data, High.Value, Low.Value, CPI.Average, High 2018, and Low 2018. Sometimes in our analysis we only want to keep certain years. For this, the traditional boolean logic mixed with Pandas slices the data into the segments we want.

In [161]:
# Rows past 2015
print(df[df.Year > 2015].head(3))

      Year    State Table_Data  High.Value  Low.Value  CPI.Average  High 2018  \
2640  2016  Alabama        ...        0.00       0.00   240.007167       0.00
2641  2016   Alaska       9.75        9.75       9.75   240.007167      10.17
2642  2016  Arizona       8.05        8.05       8.05   240.007167       8.40

      Low.2018
2640      0.00
2641     10.17
2642      8.40

Segmenting on multiple conditions is also desirable. Most programs allow for an "AND" operator and an "OR" operator.

In [162]:
# California AND 2010
print(df[(df.Year == 2010) & (df.State == 'California')].head(3))

      Year       State Table_Data  High.Value  Low.Value  CPI.Average  \
2314  2010  California          8         8.0        8.0     218.0555

      High 2018  Low.2018
2314       9.19      9.19

In [163]:
# Alabama OR before 2015
print(df[(df.State == "Alabama") | (df.Year < 2015)].head(3))

   Year    State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968  Alabama                  NaN        0.00      0.000    34.783333
1  1968   Alaska                  2.1        2.10      2.100    34.783333
2  1968  Arizona  18.72 - 26.40/wk(b)        0.66      0.468    34.783333

   High 2018  Low.2018
0       0.00      0.00
1      15.12     15.12
2       4.75      3.37

The traditional Python index slicers are also applicable for DataFrames with the .loc[] method.

In [164]:
print(df.iloc[99])
print('\n')
print(df.iloc[[1, 50, 300]])

Year                       1969
State              South Dakota
Table_Data     17.00 - 20.00/wk
High.Value                  0.5
Low.Value                 0.425
CPI.Average             36.6833
High 2018                  3.41
Low.2018                    2.9
Name: 99, dtype: object


     Year      State  Table_Data  High.Value  Low.Value  CPI.Average  \
1    1968     Alaska         2.1         2.1       2.10    34.783333
50   1968   Virginia         ...         0.0       0.00    34.783333
300  1973  Minnesota  .75 - 1.60         1.6       0.75    44.400000

     High 2018  Low.2018
1        15.12     15.12
50        0.00      0.00
300       9.02      4.23

Often times, exporting summary stats in a different document type is the bet way to visualize the results and understand the data.

In [205]:
# Export Summary Stats
df.describe()
print(df.describe())
np.round(df.describe(), 2)
np.round(df.describe(), 2).T
df.describe().transpose().to_csv('summary stats.csv', sep=',')

           City   Number of weekly riders  Price per week  Population of city  \
count  27.000000                27.000000       27.000000        2.700000e+01
mean   14.000000            160026.074074       49.925926        1.680111e+06
std     7.937254             21301.097303       27.627921        6.780307e+04
min     1.000000            115696.000000       15.000000        1.590000e+06
25%     7.500000            149600.000000       27.500000        1.617500e+06
50%    14.000000            161600.000000       40.000000        1.695000e+06
75%    20.500000            176000.000000       75.000000        1.725000e+06
max    27.000000            192000.000000      102.000000        1.800000e+06

       Monthly income of riders  Average parking rates per month
count                 27.000000                        27.000000
mean               11063.259259                       107.037037
std                 3416.627944                        45.346089
min                 5800.000000                        50.000000
25%                 8400.000000                        75.000000
50%                11600.000000                       100.000000
75%                13888.000000                       140.000000
max                16200.000000                       200.000000

### Data Manipulation

The standard way to create a new Pandas column or replace an old one is to call the Series (whether it exists or not) on the left hand side and set it equal to the expression that expresses that value you want to create. For example:

In [165]:
# Creating a new variable
df['7'] = 7
print(df.head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  7
0       0.00      0.00  7
1      15.12     15.12  7
2       4.75      3.37  7
3       1.12      1.12  7
4      11.88     11.88  7

In [166]:
# Replace an old variable
df['7'] = 8
print(df.head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  7
0       0.00      0.00  8
1      15.12     15.12  8
2       4.75      3.37  8
3       1.12      1.12  8
4      11.88     11.88  8

In [167]:
# Renaming Variables (Mass renaming)
print(df.head())
print("\n")
print(df.rename(index=str, columns={"Year": "Date", "Table_Data": "Values"}).head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  7
0       0.00      0.00  8
1      15.12     15.12  8
2       4.75      3.37  8
3       1.12      1.12  8
4      11.88     11.88  8


   Date       State               Values  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  7
0       0.00      0.00  8
1      15.12     15.12  8
2       4.75      3.37  8
3       1.12      1.12  8
4      11.88     11.88  8

In [168]:
# Dropping a variable
df = df.drop("7", axis=1)
print(df.head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018
0       0.00      0.00
1      15.12     15.12
2       4.75      3.37
3       1.12      1.12
4      11.88     11.88

Basic math functions are easily applied in Pandas:

In [169]:
df['Difference'] = df['High.Value'] + df['Low.Value']
df['High*2'] = df['High.Value']*2
df['Low*2'] = df['Low.Value']*2
print(df.head())

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  Difference  High*2   Low*2
0       0.00      0.00      0.0000  0.0000  0.0000
1      15.12     15.12      4.2000  4.2000  4.2000
2       4.75      3.37      1.1280  1.3200  0.9360
3       1.12      1.12      0.3125  0.3125  0.3125
4      11.88     11.88      3.3000  3.3000  3.3000

More complex opeartions can be solved through the .map() method. In the example below, a function using sklearn's min/max scaler will be applied to a Pandas column:

.map() could use a dictionary to change results. This could help clean code when replacing a large amount of values. Here we create an abbrev column for state abbreviations (we will create it and drop the variable after):

In [170]:
# Using Data.map
state_2 = {'OH': 'Ohio', 'Illinois': 'IL', 'California': 'CA', 'Texas': 'TX'}

df['abbrev'] = df['State'].map(state_2)

In [171]:
df.sort_values('abbrev', ascending=True).head()
df = df.drop("abbrev", axis=1)

You can use .apply() to apply a function to a Series. You can either specify the function or use the lambda anonymous function:

In [172]:
# Specfying a function
def add(x):
    x = x + 1
    return x

print(df['Year'].head())
print("\n")
print(df['Year'].apply(add).head())

0    1968
1    1968
2    1968
3    1968
4    1968
Name: Year, dtype: int64


0    1969
1    1969
2    1969
3    1969
4    1969
Name: Year, dtype: int64

In [173]:
# Lambda Functions
## You can skip the defining of a fucntion if its simple enough 
print(df['Year'].head())
print("\n")
print((df['Year'].apply(lambda x: x + 1).head()))

0    1968
1    1968
2    1968
3    1968
4    1968
Name: Year, dtype: int64


0    1969
1    1969
2    1969
3    1969
4    1969
Name: Year, dtype: int64

Missing values are a huge part of data cleaning and something to always be mindful of. Pandas codes missing values as numpy NAN values. Let's look

In [174]:
print(df['Table_Data'].head(10))
print("\n")
print(df['Year'].head(10))

0                    NaN
1                    2.1
2    18.72 - 26.40/wk(b)
3            1.25/day(b)
4                1.65(b)
5         1.00 - 1.25(b)
6                    1.4
7                   1.25
8            1.25 - 1.40
9          $1.15 & $1.60
Name: Table_Data, dtype: object


0    1968
1    1968
2    1968
3    1968
4    1968
5    1968
6    1968
7    1968
8    1968
9    1968
Name: Year, dtype: int64

In [175]:
# Managing Missing Values
print(df['Table_Data'].isnull().values.any())
print(df['Year'].isnull().values.any())

True
False

We can also use .drop_duplicates(keep = "first") to drop all but the first observations of duplicates.

In [176]:
# Check duplicates
data = {'col_1': [3, 3, 3, 3], 'col_2': ['a', 'a', 'a', 'a']}
data_dup = pd.DataFrame.from_dict(data)
print(data_dup)

print("\n")

data_dup = data_dup.drop_duplicates(keep="last")

print(data_dup)

   col_1 col_2
0      3     a
1      3     a
2      3     a
3      3     a


   col_1 col_2
3      3     a

Data can be reshaped using a variet of Pandas functions. Going from wide to long has a built in function:

In [177]:
# Reshaping Data - Loading in a new dataset
df_ex = pd.DataFrame({
    'Unique Family Identifier': [1000, 1000, 1000, 1001, 1001, 1001, 1002, 324, 234],
    'Order': [1, 2, 3, 1, 2, 3, 1, 2, 3], 
    'az1': [28, 82, 23, 234, 234, 324, 546, 546, 5464],
    'az2': [2342, 2342, 54645, 56765, 65765, 65756, 3453, 56756, 3453]})


reshape = pd.wide_to_long(df_ex, stubnames='az', i=['Unique Family Identifier', 'Order'], j='age')

print(df.head())
print("\n")
print(reshape)

   Year       State           Table_Data  High.Value  Low.Value  CPI.Average  \
0  1968     Alabama                  NaN     0.00000    0.00000    34.783333
1  1968      Alaska                  2.1     2.10000    2.10000    34.783333
2  1968     Arizona  18.72 - 26.40/wk(b)     0.66000    0.46800    34.783333
3  1968    Arkansas          1.25/day(b)     0.15625    0.15625    34.783333
4  1968  California              1.65(b)     1.65000    1.65000    34.783333

   High 2018  Low.2018  Difference  High*2   Low*2
0       0.00      0.00      0.0000  0.0000  0.0000
1      15.12     15.12      4.2000  4.2000  4.2000
2       4.75      3.37      1.1280  1.3200  0.9360
3       1.12      1.12      0.3125  0.3125  0.3125
4      11.88     11.88      3.3000  3.3000  3.3000


                                       az
Unique Family Identifier Order age
1000                     1     1       28
                               2     2342
                         2     1       82
                               2     2342
                         3     1       23
                               2    54645
1001                     1     1      234
                               2    56765
                         2     1      234
                               2    65765
                         3     1      324
                               2    65756
1002                     1     1      546
                               2     3453
324                      2     1      546
                               2    56756
234                      3     1     5464
                               2     3453

Going from wide to long requires the use of unstack()

In [178]:
normal = reshape.unstack()
normal.columns = normal.columns.map('{0[0]}{0[1]}'.format)
normal.reset_index()
print(normal.head())

                                 az1    az2
Unique Family Identifier Order
234                      3      5464   3453
324                      2       546  56756
1000                     1        28   2342
                         2        82   2342
                         3        23  54645

Merging data uses pd.merge(data_1, data_2, on = identifier):

In [179]:
# Merging/Appending Data
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})
print(left_frame)
print('\n')
print(right_frame)

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

In [180]:
pd.merge(left_frame, right_frame, on='key', how='inner')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

In [181]:
pd.merge(left_frame, right_frame, on='key', how='left')

   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

In [182]:
pd.merge(left_frame, right_frame, on='key', how='right')

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h
3    5        NaN           i
4    6        NaN           j

In [183]:
pd.merge(left_frame, right_frame, on='key', how='outer')


pd.concat([left_frame, right_frame])
pd.concat([left_frame, right_frame], axis=1)

D:\Users\asimon\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  after removing the cwd from sys.path.

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

Collapsing data is accomplished by the .groupby() function:

In [189]:
# Collapsing Data
by_year = df.groupby('Year')
print(by_year.count().head()) # NOT NULL records within each column
print('\n')
print(by_year.size().tail()) # total records for each department

      State  Table_Data  High.Value  Low.Value  CPI.Average  High 2018  \
Year
1968     55          53          54         54           55         54
1969     55          54          54         54           55         54
1970     55          54          54         54           55         54
1971     55          54          54         54           55         54
1972     55          54          54         54           55         54

      Low.2018  Difference  High*2  Low*2
Year
1968        54          54      54     54
1969        54          54      54     54
1970        54          54      54     54
1971        54          54      54     54
1972        54          54      54     54


Year
2013    55
2014    55
2015    55
2016    55
2017    55
dtype: int64

In [190]:
print(by_year.sum()[20:25]) # total salaries of each department
print('\n')
print(by_year.mean()[20:25]) # average salary of each department
print('\n')
print(by_year.median()[20:25]) # take that, RDBMS!

      High.Value  Low.Value  CPI.Average  High 2018  Low.2018  Difference  \
Year
1988      146.75     142.75  6504.208332     310.65    302.19      289.50
1989      146.75     142.75  6818.166669     296.49    288.41      289.50
1990      146.75     142.75  7186.208331     281.27    273.61      289.50
1991      179.20     175.00  7490.541668     329.52    321.80      354.20
1992      194.17     189.57  7717.416668     346.40    338.19      383.74

      High*2   Low*2
Year
1988  293.50  285.50
1989  293.50  285.50
1990  293.50  285.50
1991  358.40  350.00
1992  388.34  379.14


      High.Value  Low.Value  CPI.Average  High 2018  Low.2018  Difference  \
Year
1988    2.668182   2.595455   118.258333   5.648182  5.494364    5.263636
1989    2.668182   2.595455   123.966667   5.390727  5.243818    5.263636
1990    2.668182   2.595455   130.658333   5.114000  4.974727    5.263636
1991    3.258182   3.181818   136.191667   5.991273  5.850909    6.440000
1992    3.530364   3.446727   140.316667   6.298182  6.148909    6.977091

        High*2     Low*2
Year
1988  5.336364  5.190909
1989  5.336364  5.190909
1990  5.336364  5.190909
1991  6.516364  6.363636
1992  7.060727  6.893455


      High.Value  Low.Value  CPI.Average  High 2018  Low.2018  Difference  \
Year
1988        3.35       3.35   118.258333       7.09      7.09         6.7
1989        3.35       3.35   123.966667       6.77      6.77         6.7
1990        3.35       3.35   130.658333       6.42      6.42         6.7
1991        3.80       3.80   136.191667       6.99      6.99         7.6
1992        4.25       4.25   140.316667       7.58      7.58         8.5

      High*2  Low*2
Year
1988     6.7    6.7
1989     6.7    6.7
1990     6.7    6.7
1991     7.6    7.6
1992     8.5    8.5

In [191]:
by_year.State.nunique().sort_values(ascending=False)[:5]

Year
2017    55
1980    55
1990    55
1989    55
1988    55
Name: State, dtype: int64